# Test 0 (Query5-20 11-TP - Hybrid)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup2> . ?v0 <http://xmlns.com/foaf/givenName> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v1 . ?v7 <http://schema.org/director> ?v6 . ?v7 <http://schema.org/actor> ?v8 . ?v7 <http://purl.org/stuff/rev#hasReview> ?v9 . ?v7 <http://ogp.me/ns#tag> <http://db.uwaterloo.ca/~galuc/wsdbm/Topic144> . ?v7 <http://ogp.me/ns#title> ?v10 }
# Test 1 (Query8 4-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 }
# Test 2 (Query6 9-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 }
# Test 3 (Query7 10-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User1035> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v10 }
# Test 4 (Query7 11-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v10 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v11 }
