# Test 0 (Query1 4-TP - Star)
SELECT * WHERE { ?v0 <http://schema.org/telephone> ?v1 . ?v0 <http://schema.org/email> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> }
# Test 1 (Query2 5-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://schema.org/telephone> ?v4 }
# Test 2 (Query3 6-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf>  ?v2 . ?v0 <http://purl.org/dc/terms/Location> ?v3 . ?v0 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup5> . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v5 . ?v0 <http://xmlns.com/foaf/givenName> ?v6 }
# Test 3 (Query4 7-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/userId> "6347025" . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 }
# Test 4 (Query5 8-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User585> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 }
# Test 5 (Query6 9-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 }
# Test 6 (Query7 10-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User1035> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v10 }
# Test 7 (Query8 4-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 }
# Test 8 (Query9 5-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 }
# Test 9 (Query10 6-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 }
# Test 10 (Query11 7-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 11 (Query12 8-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 }
# Test 12 (Query13 9-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> <http://db.uwaterloo.ca/~galuc/wsdbm/Country0> }
# Test 13 (Query14 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 14 (Query3-15 6-TP - Hybrid)
SELECT * WHERE { ?v0 <http://ogp.me/ns#tag> ?v1 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v2 . ?v3 <http://schema.org/trailer> ?v4 . ?v3 <http://schema.org/keywords> ?v5 . ?v3 <http://db.uwaterloo.ca/~galuc/wsdbm/hasGenre> ?v0 . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://db.uwaterloo.ca/~galuc/wsdbm/ProductCategory2> }
# Test 15 (Query4-16 7-TP - Hybrid)
SELECT * WHERE { ?v0 <http://ogp.me/ns#title> ?v2 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v3 . ?v0 <http://schema.org/caption> ?v4 . ?v0 <http://schema.org/description> ?v5 . ?v1 <http://schema.org/url> ?v6 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v7 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/hasGenre> ?v8 }
# Test 16 (Query5-17 8-TP - Hybrid)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> <http://db.uwaterloo.ca/~galuc/wsdbm/City207> }
# Test 17 (Query18 9-TP - Hybrid)
SELECT * WHERE { ?v0 <http://xmlns.com/foaf/homepage> ?v1 . ?v2 <http://purl.org/goodrelations/includes> ?v0 . ?v0 <http://ogp.me/ns#tag> ?v3 . ?v0 <http://schema.org/description> ?v4 . ?v0 <http://schema.org/contentSize> ?v8 . ?v1 <http://schema.org/url> ?v5 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v6 . ?v1 <http://schema.org/language> <http://db.uwaterloo.ca/~galuc/wsdbm/Language0> . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v0 }
# Test 18 (Query19 10-TP - Hybrid)
SELECT * WHERE { ?v0 <http://schema.org/legalName> ?v1 . ?v0 <http://purl.org/goodrelations/offers> ?v2 . ?v2 <http://schema.org/eligibleRegion> ?v10 . ?v2 <http://purl.org/goodrelations/includes> ?v3 . ?v4 <http://schema.org/jobTitle> ?v5 . ?v4 <http://xmlns.com/foaf/homepage> ?v6 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v7 . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v3 . ?v3 <http://purl.org/stuff/rev#hasReview> ?v8 . ?v8 <http://purl.org/stuff/rev#totalVotes> ?v9 }
# Test 19 (Query20 11-TP - Hybrid)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup2> . ?v0 <http://xmlns.com/foaf/givenName> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v1 . ?v7 <http://schema.org/director> ?v6 . ?v7 <http://schema.org/actor> ?v8 . ?v7 <http://purl.org/stuff/rev#hasReview> ?v9 . ?v7 <http://ogp.me/ns#tag> <http://db.uwaterloo.ca/~galuc/wsdbm/Topic144> . ?v7 <http://ogp.me/ns#title> ?v10 }
# Test 20 (Query21 12-TP - Hybrid)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://schema.org/telephone> ?v4 . ?v0 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup2> . ?v0 <http://xmlns.com/foaf/givenName> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v1 . ?v7 <http://schema.org/director> ?v6 . ?v7 <http://schema.org/actor> ?v8 . ?v7 <http://purl.org/stuff/rev#hasReview> ?v9 . ?v7 <http://ogp.me/ns#tag> <http://db.uwaterloo.ca/~galuc/wsdbm/Topic144> . ?v7 <http://ogp.me/ns#title> ?v10 }
