# Test 12 (Query13 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 3 (Query4 7-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/userId> "6347025" . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 }
# Test 13 (Query14 11-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v0 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 4 (Query5 8-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User585> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 }
# Test 5 (Query6 9-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 }
# Test 6 (Query7 10-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User1035> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v10 }
# Test 19 (Query5-20 11-TP - Hybrid)
SELECT * WHERE { ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v7 . ?v5 <http://schema.org/email> ?v6 . ?v5 <http://xmlns.com/foaf/familyName> ?v11 . ?v7 <http://schema.org/actor> ?v4 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v4 . ?v7 <http://purl.org/stuff/rev#hasReview> ?v0 . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/hasGenre> ?v1 . ?v7 <http://schema.org/actor> ?v2 . ?v7 <http://ogp.me/ns#title> ?v3 . ?v4 <http://xmlns.com/foaf/givenName> ?v8 . ?v4 <http://xmlns.com/foaf/familyName> ?v9 }
