# Test 15 (Query4-16 7-TP - Hybrid)
SELECT * WHERE { ?v0 <http://ogp.me/ns#title> ?v2 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v3 . ?v0 <http://schema.org/caption> ?v4 . ?v0 <http://schema.org/description> ?v5 . ?v1 <http://schema.org/url> ?v6 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v7 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/hasGenre> ?v8 }
# Test 16 (Query5-17 8-TP - Hybrid)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> <http://db.uwaterloo.ca/~galuc/wsdbm/City207> }
# Test 17 (Query18 9-TP - Hybrid)
SELECT * WHERE { ?v0 <http://xmlns.com/foaf/homepage> ?v1 . ?v2 <http://purl.org/goodrelations/includes> ?v0 . ?v0 <http://ogp.me/ns#tag> ?v3 . ?v0 <http://schema.org/description> ?v4 . ?v0 <http://schema.org/contentSize> ?v8 . ?v1 <http://schema.org/url> ?v5 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v6 . ?v1 <http://schema.org/language> <http://db.uwaterloo.ca/~galuc/wsdbm/Language0> . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v0 }
# Test 13 (Query14 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
