# Test 0 (Query8 5-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 }
# Test 1 (Query9 6-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 }
# Test 2 (Query10 7-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 3 (Query11 8-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 }
# Test 4 (Query12 9-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> <http://db.uwaterloo.ca/~galuc/wsdbm/Country0> }
# Test 5 (Query13 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 6 (Query14 11-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v0 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
