# Test 1 (Query Q1 4-TP K=2000)
SELECT * WHERE { ?person <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/London> . ?person <http://dbpedia.org/ontology/birthDate> ?birth . ?person <http://xmlns.com/foaf/0.1/name> ?name . ?person <http://dbpedia.org/ontology/deathDate> ?death }
# Test 2 (Query Q2 4-TP All fails for K<333 or succeeds)
SELECT * WHERE { ?lang <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Language> . ?nation <http://dbpedia.org/ontology/language> ?lang . ?nation <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?nation <http://www.w3.org/2000/01/rdf-schema#comment> ?com }
# Test 3 (Query Q3 5-TP K between 200000 and 300000)
SELECT * WHERE { ?s <http://xmlns.com/foaf/0.1/name> ?player . ?s <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer> . ?s <http://dbpedia.org/property/position> ?position . ?s <http://dbpedia.org/property/clubs> ?club . ?s <http://dbpedia.org/ontology/birthPlace> ?place }
# Test 4 (Query Q4 5-TP K between 5000 and 10000)
SELECT * WHERE{ ?person <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://xmlns.com/foaf/0.1/Person> . ?person <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer> . ?person <http://xmlns.com/foaf/0.1/name> ?name . ?person <http://dbpedia.org/ontology/birthPlace> ?birthPlace . ?person <http://dbpedia.org/ontology/influenced> ?person2 }
# Test 5 (Query Q5 6-TP K<127)
SELECT * WHERE { ?subject <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?subject <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Paul_Newman> . ?subject <http://dbpedia.org/ontology/starring> ?actors . ?subject <http://www.w3.org/2000/01/rdf-schema#comment> ?abstract . ?subject <http://www.w3.org/2000/01/rdf-schema#label> ?label . ?subject <http://dbpedia.org/ontology/releaseDate> ?released } 
# Test 6 (Query Q6 7-TP K between 200000 and 500000)
SELECT * WHERE { ?s <http://xmlns.com/foaf/0.1/name> ?name . ?s <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer> . ?s <http://dbpedia.org/property/position> ?position . ?s <http://dbpedia.org/property/clubs> ?club . ?club <http://dbpedia.org/ontology/capacity> ?cap . ?s <http://dbpedia.org/ontology/birthPlace> ?place . ?s <http://dbpedia.org/ontology/number> ?tricot }
# Test 7 (Query Q7 8-TP K between 1000 and 40000)
SELECT * WHERE{ ?musician <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist> . ?musician <http://dbpedia.org/ontology/activeYearsStartYear> ?activeyearsstartyear . ?musician <http://dbpedia.org/ontology/associatedBand> ?associatedband . ?musician <http://dbpedia.org/ontology/birthPlace> ?birthplace . ?musician <http://dbpedia.org/ontology/genre> ?genre . ?musician <http://dbpedia.org/ontology/recordLabel> ?recordlable . ?musician <http://dbpedia.org/property/voiceType> ?voicetype . ?artist <http://dbpedia.org/ontology/artist> ?musician }
# Test 8 (Query Q8 9-TP K between 2000 and 250000)
SELECT * WHERE{ ?musician <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist> . ?musician <http://dbpedia.org/ontology/activeYearsStartYear> ?activeyearsstartyear . ?musician <http://dbpedia.org/ontology/associatedBand> ?associatedband . ?musician <http://dbpedia.org/ontology/birthPlace> ?birthplace . ?musician <http://dbpedia.org/ontology/genre> ?genre . ?musician <http://dbpedia.org/ontology/recordLabel> ?recordlable . ?musician <http://dbpedia.org/property/voiceType> ?voicetype . ?artist <http://dbpedia.org/ontology/artist> ?musician . ?starring <http://dbpedia.org/ontology/starring> ?musician }
# Test 9 (Query Q9 10-TP K<189)
SELECT * WHERE{ ?musician <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/MusicalArtist> . ?musician <http://dbpedia.org/ontology/activeYearsStartYear> ?activeyearsstartyear . ?musician <http://dbpedia.org/ontology/associatedBand> ?associatedband . ?musician <http://dbpedia.org/ontology/birthPlace> ?birthplace . ?musician <http://dbpedia.org/ontology/genre> ?genre . ?musician <http://dbpedia.org/ontology/recordLabel> ?recordlable . ?musician <http://dbpedia.org/property/voiceType> ?voicetype . ?artist <http://dbpedia.org/ontology/artist> ?musician . ?starring <http://dbpedia.org/ontology/starring> ?musician . ?writer <http://dbpedia.org/ontology/writer> ?musician }
