# Test 0 (Query1 4-TP - Star)
SELECT * WHERE { ?v0 <http://schema.org/telephone> ?v1 . ?v0 <http://schema.org/email> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> }
# Test 1 (Query2 5-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://schema.org/telephone> ?v4 }
# Test 2 (Query3 6-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf>  ?v2 . ?v0 <http://purl.org/dc/terms/Location> ?v3 . ?v0 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup5> . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v5 . ?v0 <http://xmlns.com/foaf/givenName> ?v6 }
# Test 3 (Query4 7-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/userId> "6347025" . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 }
# Test 4 (Query5 8-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User585> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 }
# Test 5 (Query6 9-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 }
# Test 6 (Query7 10-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> <http://db.uwaterloo.ca/~galuc/wsdbm/User1035> . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v10 }
# Test 7 (Query8 5-TP - Chain)
SELECT * WHERE { ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v2 . ?v2 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v3 . ?v3 <http://purl.org/stuff/rev#hasReview> ?v4 . ?v4 <http://purl.org/stuff/rev#reviewer> ?v5 . ?v5 <http://xmlns.com/foaf/age> <http://db.uwaterloo.ca/~galuc/wsdbm/AgeGroup0> }
# Test 8 (Query9 6-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 }
# Test 9 (Query10 7-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 10 (Query11 8-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/actor> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 }
# Test 11 (Query12 9-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> <http://db.uwaterloo.ca/~galuc/wsdbm/Country0> }
# Test 12 (Query13 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 14 (Query15 9-TP - Hybrid)
SELECT * WHERE { ?v0 <http://xmlns.com/foaf/homepage> ?v1 . ?v2 <http://purl.org/goodrelations/includes> ?v0 . ?v0 <http://ogp.me/ns#tag> ?v3 . ?v0 <http://schema.org/description> ?v4 . ?v0 <http://schema.org/contentSize> ?v8 . ?v1 <http://schema.org/url> ?v5 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v6 . ?v1 <http://schema.org/language> <http://db.uwaterloo.ca/~galuc/wsdbm/Language0> . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v0 }
