# Test 1 (Query1 C3 6-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf>  ?v2 . ?v0 <http://purl.org/dc/terms/Location> ?v3 . ?v0 <http://xmlns.com/foaf/age> ?v4 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v5 . ?v0 <http://xmlns.com/foaf/givenName> ?v6 }
# Test 2 (Query2 F4 9-TP - Hybrid)
SELECT * WHERE { ?v0 <http://xmlns.com/foaf/homepage> ?v1 . ?v2 <http://purl.org/goodrelations/includes> ?v0 . ?v0 <http://ogp.me/ns#tag> ?v3 . ?v0 <http://schema.org/description> ?v4 . ?v0 <http://schema.org/contentSize> ?v8 . ?v1 <http://schema.org/url> ?v5 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/hits> ?v6 . ?v1 <http://schema.org/language> <http://db.uwaterloo.ca/~galuc/wsdbm/Language0> . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v0 }
# Test 3 (Query3 F5 6-TP - Hybrid)
SELECT * WHERE { ?v0 <http://purl.org/goodrelations/includes> ?v1 . ?v2 <http://purl.org/goodrelations/offers> ?v0 . ?v0 <http://purl.org/goodrelations/price> ?v3 . ?v0 <http://purl.org/goodrelations/validThrough> ?v4 . ?v1 <http://ogp.me/ns#title> ?v5 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?v6 }
# Test 4 (Query4 NO 9-TP)
SELECT * WHERE { ?v1 <http://purl.org/goodrelations/includes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 }
# Test 5 (Query5 ML1 6-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://schema.org/author> ?v3 . ?v3 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v5 . ?v5 <http://schema.org/contentRating> ?v6 }
# Test 6 (Query6 ML1 7-TP - Hybrid)
SELECT * WHERE { ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v6 . ?v6 <http://schema.org/language> ?v7 }
# Test 7 (Query7 ML1 9-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v2 . ?v2 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v3 . ?v3 <http://purl.org/stuff/rev#hasReview> ?v4 . ?v4 <http://purl.org/stuff/rev#reviewer> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 . ?v6 <http://schema.org/actor> ?v7 . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v8 . ?v8 <http://schema.org/telephone> ?v9 }
# Test 8 (Query8 ML1 10-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v2 . ?v2 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v3 . ?v3 <http://schema.org/author> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v6 . ?v6 <http://purl.org/ontology/mo/artist> ?v7 . ?v7 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v8 . ?v8 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v9 . ?v9 <http://xmlns.com/foaf/homepage> ?v10 }
# Test 9 (Query9 ML2 5-TP - Chain)
SELECT * WHERE { ?v0 <http://schema.org/contactPoint> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v2 . ?v2 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v3 . ?v3 <http://purl.org/dc/terms/Location> ?v4 . ?v4 <http://www.geonames.org/ontology#parentCountry> ?v5 }
# Test 10 (Query10 ML2 10-TP - Chain)
SELECT * WHERE { ?v0 <http://purl.org/goodrelations/offers> ?v1 . ?v1 <http://purl.org/goodrelations/includes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/actor> ?v8 . ?v8 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v9 . ?v9 <http://schema.org/language> ?v10 }
# Test 11 (Query11 ML2 8-TP - Chain)
SELECT * WHERE { ?v0 <http://purl.org/goodrelations/offers> ?v1 . ?v1 <http://purl.org/goodrelations/includes> ?v2 . ?v2 <http://schema.org/author> ?v3 . ?v3 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://xmlns.com/foaf/homepage> ?v8 }
# Test 12 (Query12 ML2 9-TP - Chain)
SELECT * WHERE { ?v0 <http://schema.org/contactPoint> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v2 . ?v2 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v3 . ?v3 <http://purl.org/stuff/rev#hasReview> ?v4 . ?v4 <http://purl.org/stuff/rev#reviewer> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://purl.org/stuff/rev#hasReview> ?v8 . ?v8 <http://purl.org/stuff/rev#title> ?v9 }
# Test 13 (Query13 IL1 10-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 14 (Query14 IL1 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User0> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 15 (Query15 S1 7-TP - Hybrid)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://purl.org/dc/terms/Location> <http://db.uwaterloo.ca/~galuc/wsdbm/City0> . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v2 . ?v0 <http://schema.org/nationality> ?v3 . ?v1 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 }
# Test 100 (Query100 NO ML2-6 6-TP - Chain)
SELECT * WHERE { ?v0 <http://purl.org/goodrelations/offers> ?v1 . ?v1 <http://purl.org/goodrelations/includes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v5 . ?v5 <http://schema.org/contentRating> ?v6 }
# Test 16 (Query17 IL2-10 7-TP - Chain)
SELECT * WHERE { ?v3 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v8 . ?v8 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v9 . ?v9 <http://purl.org/stuff/rev#hasReview> ?v12 . ?v12 <http://purl.org/stuff/rev#reviewer> ?v13 . ?v13 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v14 . ?v14 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> <http://db.uwaterloo.ca/~galuc/wsdbm/Product2> }
# Test 17 (Query18 7-TP - Star)
SELECT * WHERE { ?v0 <http://purl.org/goodrelations/includes> ?v1 . ?v0 <http://purl.org/goodrelations/price> ?v3 . ?v0 <http://purl.org/goodrelations/serialNumber> ?v4 . ?v0 <http://purl.org/goodrelations/validFrom> ?v5 . ?v0 <http://schema.org/eligibleQuantity> ?v7 . ?v0 <http://schema.org/eligibleRegion> ?v8 . ?v0 <http://schema.org/priceValidUntil> ?v9 }
# Test 18 (Query22 NO 6-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/familyName> ?v4 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> <http://db.uwaterloo.ca/~galuc/wsdbm/Website1> }
# Test 19 (Query19 4-TP - Star)
SELECT * WHERE { ?v0 <http://schema.org/telephone> ?v1 . ?v0 <http://schema.org/email> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v4  }
# Test 20 (Query20 5-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/familyName> ?v4 }
# Test 21 (Query21 6-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf>  ?v2 . ?v0 <http://purl.org/dc/terms/Location> ?v3 . ?v0 <http://xmlns.com/foaf/age> ?v4 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v5 . ?v0 <http://xmlns.com/foaf/givenName> ?v6 }
# Test 22 (Query22 7-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/familyName> ?v4 . ?v0 <http://xmlns.com/foaf/givenName> ?v6 }
# Test 23 (Query23 8-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://schema.org/nationality> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/gender> ?v4 . ?v0 <http://schema.org/email> ?v5 . ?v0 <http://xmlns.com/foaf/familyName> ?v6 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> ?v7 . ?v0 <http://xmlns.com/foaf/givenName> ?v8 }
# Test 24 (Query24 9-TP - Star)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v1 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v2 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v2 . ?v0 <http://schema.org/email> ?v3 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> <http://db.uwaterloo.ca/~galuc/wsdbm/Product0> . ?v0 <http://xmlns.com/foaf/familyName> ?v4 . ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/subscribes> <http://db.uwaterloo.ca/~galuc/wsdbm/Website1> . ?v0 <http://xmlns.com/foaf/givenName> ?v6 . ?v0 <http://schema.org/birthDate> ?v7 }
# Test 25 (Query12 9-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> <http://db.uwaterloo.ca/~galuc/wsdbm/Country0> }
# Test 26 (Query13 10-TP - Chain)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 . ?v9 <http://www.geonames.org/ontology#parentCountry> ?v10 }
# Test 27 (Query16 9-TP - Hybrid)
SELECT * WHERE { <http://db.uwaterloo.ca/~galuc/wsdbm/User758> <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/author> ?v8 . ?v8 <http://purl.org/dc/terms/Location> ?v9 }
# Test 28 (Query14 11-TP - Chain)
SELECT * WHERE { ?v0 <http://db.uwaterloo.ca/~galuc/wsdbm/follows> ?v1 . ?v1 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?v2 . ?v2 <http://purl.org/stuff/rev#hasReview> ?v3 . ?v3 <http://purl.org/stuff/rev#reviewer> ?v4 . ?v4 <http://db.uwaterloo.ca/~galuc/wsdbm/makesPurchase> ?v6 . ?v6 <http://db.uwaterloo.ca/~galuc/wsdbm/purchaseFor> ?v7 . ?v7 <http://schema.org/actor> ?v8 . ?v8 <http://db.uwaterloo.ca/~galuc/wsdbm/friendOf> ?v5 . ?v5 <http://db.uwaterloo.ca/~galuc/wsdbm/likes> ?a }
