# Test 1 (Query Q1 5-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University451.edu> }
# Test 1 (Query Q2 6-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University451.edu> }
# Test 2 (Query Q3 7-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University451.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?k }
# Test 3 (Query Q4 8-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#undergraduateDegreeFrom> <http://www.University451.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?r . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?g }
# Test 4 (Query Q5 9-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> ?Y3 . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?k . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?r . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?d . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> <http://www.University196.edu> }
# Test 5 (Query Q6 10-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?r . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> "FullProfessor4" . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?ss . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?ssq . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?g }
# Test 6 (Query Q7 11-TP)
SELECT * WHERE { ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#memberOf> <http://www.Department0.University0.edu> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#emailAddress> ?Y1 . ?X <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://swat.cse.lehigh.edu/onto/univ-bench.owl#FullProfessor> . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#degreeFrom> ?u . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#teacherOf> ?t . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#telephone> ?r . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#name> "FullProfessor4" . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#researchInterest> ?ss . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#doctoralDegreeFrom> ?d . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#mastersDegreeFrom> ?ssq . ?X <http://swat.cse.lehigh.edu/onto/univ-bench.owl#worksFor> ?g }
